<template>
  <div>
    <header class="header">
      <span class="svg-container" @click="back">
        <svg-icon icon-class="back" />
      </span>
      软件许可及服务协议
    </header>
    <div class="wrapper" ref="wrapper">
      <div class="wrap">
        <h3 class="msg-title"><span class="text-green">用户</span>《软件许可及服务协议》</h3>
        <div class="msg-content">
            <p>一、本《软件许可及服务协议》（以下简称《协议》 ）是服务使用本人（以下简称“用户”）与杭州快消帮网络科技有限公司（以下简称“本公司”或“我们”）之间关于用户下载、安装、使用“快消帮”软件（包括但不限于PC版及移动电话版等各种无线手持终端版本的“快消帮”软件，以下简称“软件”）；注册、使用、管理快消帮帐号；以及使用本公司提供的相关服务所订立的协议。本《协议》描述本公司与用户之间关于“软件”许可使用及服务相关方面的权利义务。“用户”是指通过快消帮提供的获取软件授权和帐号注册的途径获得软件产品授权许可以及本公司相关服务的个人或者组织。</p>
            <p>二、“快消帮”软件由杭州快消帮网络科技有限公司研发，并同意按照本协议的规定及其不时发布的操作规定提供基于互联网以及移动网的相关服务（以下简称为“网络服务”）。为获得网络，用户应认真阅读、充分理解本《协议》中各条款，特别涉及免除或者限制本公司责任的免责条款，对用户的权利限制的条款，约定争议解决方式、司法管辖，法律适用的条款。请您审慎阅读并勾选接受或不接受本《协议》。除非您接受本《协议》所有条款，否则您无权下载、安装或使用本软件及其相关服务。您的下载、安装、使用、账号获取和登录等行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。</p>
            <p>三、本《协议》可由本公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知。用户可重新下载安装本软件或网站查阅最新版协议条款。在本公司修改 《协议》条款后，如果用户不接受修改后的条款，请立即停止使用软件和服务，用户继续使用本公司提供的软件和服务将被视为已接受了修改后的协议。</p>
            <p>四、除本《协议》有明确规定外，本《协议》并未利用本“软件”使用的公司或合作单位的其他服务规定相关的服务条款。对于这些服务，一般有单独的服务条款与本协议有冲突的地方，以单独的服务条款为准，如用户使用该服务，视为对相关服务条款的接受。</p>
            <p>五、用户注册成功后，本公司将给予每个用户一个用户账号，该账号归本公司所有，用户完成申请注册手续后，获得账号的使用权。账号使用前进进属于初始申请注册人，禁止赠与，借用，租用，转让或售卖。用户承担账号与密码的保管责任，并就其账号及密码项下之一切活动付全部责任。</p>
        <h3>1、知识产权申明</h3>
            <p>1.1 “快消帮”软件是由杭州快消帮网络科技有限公司开发，杭州快消帮是“快消帮”软件的知识产权权利人，“快消帮”软件的一切版权、商标权、专利权、商业秘密等知识产权以及相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰。图标、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，本公司享有上述知识产权。</p>
            <p>1.2 未经本公司书面同意，用户不得为任何盈利性或非盈利性的目的自行实施、利用、转让或许可任何三方实施，利用、转让上述知识产权，本公司保留追究上述未经许可行为法律责任的权利。</p>
        <h3>2、授权范围</h3>
            <p>2.1 用户可以为非商业目的在单一台终端设备上安装、使用、显示、运行“快消帮”软件。用户不得为商业运营目的安装，使用，运行“快消帮”不可以对本软件或者本软件运行过程中释放到任何计算机终端内存中的数据及软件运行过程中客户端与服务器端的交互数据进行复制，修改，挂接运行或创作任何衍生作品，形式包括插件、外挂或非经授权的第三方工具、服务接入本软件和相关系统。</p>
            <p>2.2用户不得未经本公司书面许可，将“快消帮”安装在未经公司明示许可的其他终端设备上，包括但不限于机顶盒、无线上网机、游戏机、电视机等。</p>
            <p>2.3 保留权利：未明示授权的其他一切潜力仍归本公司所有，用户使用其他权利时须取得本公司的书面同意。</p>
        <h3>3、服务内容</h3>
        <p>3.1“快消帮”服务的具体内容由本公司根据实际情况提供，主要包括协助用户下单、发送调车和运货信息、进行订单管理等服务。</p>
        <p>3.2 “快消帮”提供的部分网络服务如需收费，用户使用收费网络服务需要向本公司支付一定的费用，对于收费的网络服务，我们将在用户使用前给予用户明确的提示，只有根据提示确认其愿意支付相关费用，用户才能使用该等费用网络服务。如用户拒绝支付相关费用，则本公司有权不向用户提供该等网络服务。</p>
        <p>3.3用户理解并同意，本公司仅提供相关的网络服务，除此之外与相关网络服务相关的设备（如个人电脑，手机，其他与接入互联网或移动网有关的装置）及第三方收取的相关费用（如接入互联网儿支付的电话费及上网费，为使用移动网而支付的手机费）均应由用户自行负担。</p>
        <p>本公司仅提供相关的网络服务，除此之外对于用户之间、用户与第三方之间产生的任何问题（包括但不限于货损，货丢，费用等问题），本公司不承担任何责任。</p>
        <h3>一、服务变更、中断或终止</h3>
        <p>4.1鉴于网络服务的特殊性，用户同意本公司有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务及免费网络服务）。</p>
        <p>4.2用户理解并同意，本公司需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，本公司无需为此承担任何责任。但除特殊情况外，本公司会就上述情况事先进行通告。</p>
        <p>4.3如发生下列任何一种情形，本公司有权随时中断或终止向用户提供本协议项下的网络服务【该网络服务包括但不限于收费及免费网络服务（其中包括基于广告模式的免费网络服务）】而无需对用户或第三方承担任何责任：<br>(1)用户提供的个人资料不真实；<br>
        (2)用户违反本协议中规定的使用规则；<br>
        (3)用户在使用收费网络服务时未按照规定向本公司支付相应的服务费；<br>
        (4)相关法律法规规定的其他情形。</p>
        <p>4.4如用户注册的免费服务账号在任何连续90日内未实际使用，或者用户注册的收费网络服务的账号在其订购的收费网络服务期满之后连续180日内未实际使用，则本公司有权删除该账号并停止为该用户提供相应的网络服务。在执行账号删除之前，本公司会想用户发送通知。</p>
        <p>4.5用户注册的免费账号昵称和姓名如违反法律法规或国家政策要求，或侵犯任何第三方合法权益的情况，本公司有权禁止用户继续使用该账户、昵称。</p>
        <h3>二、使用规则</h3>
        <p>5.1司机用户在申请使用“快消帮”网络服务时，必须向本公司提供准确、真实的个人呢相关资料，且需要通过人工认证方能开始使用软件。如个人资料有任何变动，必须及时更新。更新后，本公司有权暂停该司机用户的使用权，同时需要人工再次认证方能继续使用软件。个人资料变动后，司机用户没有及时进行信息更新或者不配合本公司进行信息更新或人工认证，由此造成的损失（包括但不限于软件无法进行正常使用、与第三者发生的纠纷等），应由司机用户自行承担。</p>
        <p>5.2用户不应该将其账号、密码转让或借予他人使用，如用户发现账号遭他人非法使用，应立即通知本公司，因黑客行为、病毒等原因或因用户保管疏忽导致账号、密码遭他人非法使用、本公司不承担任何责任。</p>
        <p>5.3用户同意本公司有权提供网络服务过程中通过“快消帮”给其手机推送短信、微信或邮件。用户在其他渠道发布的货物信息，同意且授权本公司在“快消帮”内部发布。</p>
        <p>5.4用户同意本公司有权在提供网络服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息，并且用户同意接受本公司通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。</p>
        <p>5.5用户在使用“快消帮”服务过程中，必须遵循以下原则：<br>(1)遵守中国有关的法律和法规；<br>
        (2)遵守所有与网络服务有关的网络协议、规定和程序；<br>
        (3)不得为任何非法目的而使用网络服务系统；<br>
        (4)不得以任何形式使用“快消帮”服务侵犯本公司的商业利益，包括并不限于发布非经本公司许可的商业广告；<br>
        (5)不得利用“快消帮”网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；<br>
        (6)不得利用本产品提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；<br>
        (7)不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；<br>
        (8)不得利用“快消帮”服务系统进行任何不利于本公司行为（包括但不限于窃取、外泄服务系统内的信息等）。</p>
        <p>5.6本公司针对某些特定的“快消帮”网络服务的使用通过各种方式（包括但不限于网页公告，电子邮件短信提醒等)作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该网络服务，视为用户同意该等声明、通知、警示的内容并受其约束。</p>
        <p>5.7本公司有权对用户使用“快消帮”网络服务【该网络服务包括但不限于收费及免费网络服务（包括基于广告模式的免费网络服务）】的情况进行审查和监督（包括但不限于对用户存储在本公司的内容进行审核），如用户在使用网络服务时违法任何上述规定，本公司有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户改正或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。因用户自身行为需向第三方承担责任的，由用户自行承担，与本公司无关。</p>
        <h3>三、“快消帮”管理规定</h3>
        <p>6.1用户注册“快消帮”帐号，注册内容、各种信息，用户本人应当为信息的真实性负责。同时用户应当使用真实身份信息，不得以虚假、冒用的居民身份信息、企业注册信息、组织机构代码信息进行注册。</p>
        <p>6.2用户在使用“快消帮”时，需注意信息真实，诚信为本，禁止爽约，虚假单子，恶意抢单等行为，已经发现，本公司有权停止用户账户，视情节严重性可追究法律责任。</p>
        <p>6.3“快消帮”将建立健全用户信息安全管理制度、落实技术安全防范措施。本公司将对用户使用“快消帮”网络服务过程中涉及的用户隐私内容加以保护。</p>
        <h3>四、隐私保护</h3>
        <p>7.1保护用户隐私是本公司的一项基本政策，本公司保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在“快消帮”的非公开内容，但下列情况除外：<br>
        (1)事先获得用户的明确授权；<br>
        (2)根据有关的法律法规要求；<br>
        (3)按照相关政府主管部门的要求；<br>
        (4)为维护社会公众的利益；<br>
        (5)为维护本公司的合法利益；</p>
        <p>7.2“快消帮”可能会与第三方合作像用户提供相关的网络服务，在此情况下，如该第三方同意承担与本公司同等的保护用户的信息。则本公司有权将用户的注册资料等提供给第三方。</p>
        <p>7.3在不透露单个用户隐私资料的前提下，本公司有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
        <h3>五、免责申明</h3>
        <p>8.1一切移动客户端和PC端用户在下载并浏览本软件时均被视为已经仔细阅读本条款并完全同意。凡以任何方式登陆本软件，或直接、间接使用本软件资料者，均被视为自愿接受本网站相关声明和用户服务协议的约束。</p>
        <p>8.2用户理解并同意其使用本公司网络服务所存在的风险将完全由其自己承担；因其使用本公司网络服务而产生的一切后果也由其自己承担，本公司对用户不承担任何责任。</p>
        <p>8.3本软件主要为快消品供需三方提供平台服务，我们会尽量做好信息的核查，但用户需自己筛选，线下接触工作中产生的风险及附带责任我方并无义务承担。</p>
        <p>8.4本公司对网络服务不作任何类型的担保，不论是明示的、默示的或法令的保证和条件，包括但不限于网络服务的及时性、安全性、准确性。对在任何情况下因使用或不能使用本网络服务所产生的直接、间接、偶然、特殊及后续的损害及风险，本公司不承担任何责任。</p>
        <p>8.5对于不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，由用户自行承担，本公司不承担任何责任。</p>
        <p>8.6用户理解并同意，对于本公司向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，本公司无需承担任何责任：<br>
        （1）本公司向用户免费提供的各项网络服务；<br>
        （2）本公司向用户赠送的任何产品或者服务；<br>
        （3）本公司向收费网络服务用户附赠的各种产品或者服务。</p>
        <p>8.7用户（特别是司机服务）理解并同意，“快消帮”所提供的功能受制于我国的交通法律法规和管理条例，即与本产品的功能和条例发生冲突时，应以当地的交通法律法规和管理条例为最高准则。任何通过“快消帮”服务直接或间接违反当地交通法律法规和管理条例的行为，该后果应由用户承担。如有举证需要，本公司可以向有关部门提供相关数据作为证据。</p>
        <p>8.8用户（特别是司机用户）理解安全驾驶的重要性，且保证在任何可能因其安全隐患的情况下均不得使用“快消帮”，并同意一切因使用“快消帮”服务而导致的安全隐患和因此产生的纠纷和交通事故，本公司概不负责赔偿。如有举证需要，本公司可以向有关部门提供相关数据作为证据。</p>
        <p>8.9本申明未涉及的问题请参见国家有关法律法规，当本声明与国家有关法律法规冲突时，以国家法律法规为准。</p>
        <p>8.10本软件相关声明版权及其修改权、更新权和最终解释权均属本公司所有。</p>
        <p>8.11因个人操作不当导致自身信息泄露将由个人承担。</p>
        <h3>六、违约赔偿</h3>
        <p>9.1如因本公司违反有关法律、法规或由本《协议》项下的任何条款而给用户造成损失，本公司同意承担由此造成的损害赔偿责任。</p>
        <p>9.2用户同意保障和维护本公司及其他用户的利益，如因用户违反有关法律法规或本《协议》项下的任何条款而给本公司或任何其他第三方造成损失，用户同意独立承担由此造成的损害赔偿责任。</p>
        <h3>七、协议修改</h3>
        <p>10.1本公司有权随时修改本《协议》的任何条款，一旦本《协议》的内容发生变动，本公司将会直接在本公司网站上发布修改之后的协议内容，该公布行为视为本公司已经通知用户修改内容。同时本公司也可以通过其他适当方式向用户提示修改内容。</p>
        <p>10.2如果用户不同意本公司对本《协议》相关条款所做出的修改，用户应当停止使用网络服务，如果用户继续使用本软件则视为用户接受本公司对本《协议》相关条款所做的修改并同意受其约束。</p>
        <h3>八、通知送达</h3>
        <p>本《协议》项下本公司对于用户所有的通知均可通过网页公告、电子邮件、手机或者短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>
        <h3>九、法律管辖</h3>
        <p>12.1本《协议》的订立、成立、生效、履行、解释及争议的解决均应适用中华人民共和国大陆地区的法律并受中国有管辖权的法院管辖。</p>
        <p>12.2如双方就本《协议》内容或由本《协议》引起的任何任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向本公司所在地的人民法院提起诉讼。</p>
        <h3>十、其他规定</h3>
        <p>13.1本《协议》构成双方对本《协议》之约定事项及其他有关事宜的完整协议，除本《协议》规定的之外，未赋予本《协议》各方面其他权利。</p>
        <p>13.2如本《协议》中的任何条款无论因何种原因完全或部分无效或不具有执行力，本《协议》的其他条款仍应有效并且有约束力。</p>
        <p>13.3本《协议》的所有标题仅仅是为了醒目及阅读方便，本身并无实际涵义，不能作为本《协议》涵义解释之依据。</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import BScroll from 'better-scroll';

export default {
  name: 'agreement',
  data () {
    return {
      scroll: '' // 滚动对象
    }
  },
  methods: {
    back () {
      this.$router.push('/register')
    },
    _initScroll () {
      if (!this.scroll) {
        this.scroll = new BScroll(this.$refs.wrapper, {
          click: true,
          probeType: 3
        });
        console.log(this.scroll)
      } else {
        this.scroll.refresh();
      };
    }
  },
  mounted() {
    // this.scroll = new BScroll(this.$refs.wrapper)
    // console.log(this.scroll)
    this.$nextTick(()=>{
      this._initScroll();
    });
  }
}
</script>

<style lang="scss" scoped>
@import '@/styles/index.scss';
.header {
  position: relative;
  height: .44rem;
  line-height: .44rem;
  text-align: center;
  color: #fff;
  background: $bg;
  font-size: .17rem;
  .svg-container {
    position: absolute;
    left: 0;
    color: #fff;
    vertical-align: middle;
    width: .44rem;
    line-height: .44rem;
    display: inline-block;
    font-size: .2rem;
  }
}
.wrapper {
  overflow: hidden;
  position: absolute;
  z-index: 1;
  top: .44rem;
  left: 0;
  bottom: 0;
  right: 0;
  margin: 0 .15rem;
  .wrap {
    height: auto;
    .msg-title {
      margin: .1rem 0;
      padding-top: .08rem;
    }
    .msg-content {
      margin-top: .15rem;
      font-size: .14rem;
      line-height: .22rem;
      color: #333;
      p {
        margin-bottom: .1rem;
      }
      h3 {
        font-weight: bold;
        font-size: .22rem;
        margin: .05rem 0;
      }
    }
  }
}
</style>

